driver-tests/sqlse/db2/SqlSE1103_DB2/InsertOneRowWithParamTableJbi/test/SqlSE1103_DB2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sql="http://com.sun.jbi/sqlse/sqlseengine">
  <soapenv:Body>
    <sql:InsertOneRowWithParamTableRequest>
      <sql:param1>exemp</sql:param1>
      <sql:param2>3</sql:param2>
    </sql:InsertOneRowWithParamTableRequest>
  </soapenv:Body>
</soapenv:Envelope>